Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: I'll release you.
jbo: mi ba zifygau do

source: I'd love to stay.
jbo: da'i mi stali iu

source: I wouldn't do it.
jbo: da'i mi na zukte tai

source: I won't be quiet.
jbo: mi na ba smaji

source: I was young once.
jbo: ca da mi pu citno

source: I was too afraid.
jbo: mi pu dukse terpa

source: I was so certain.
jbo: mi pu taisai birti

source: I was just lucky.
jbo: sa'u mi pu zanselfu'a

source: I was in the car.
jbo: mi pu zvati lo karce

source: I was in control.
jbo: kai mi pu jitro

source: I was having fun.
jbo: gau mi mi pu ca'o se zdile

source: I was 13 in 2003.
jbo: mi pu nanca li paci ca lo nanca be li renonoci

source: I want to go out.
jbo: au klama lo bartu

source: I want to change.
jbo: mi djica lo ka cenba

source: I want the truth.
jbo: mi nitcu lo jetnu

source: I waited for Tom.
jbo: mi pu denpa tu'a la tom

source: I waited an hour.
jbo: mi pu denpa soi cacra li pa

source: I heard a scream.
jbo: mi pu tirna lo nu camki'a

source: I feel so lonely.
jbo: mi tai seicni

source: Everyone had fun.
jbo: ro da pu se zdile

source: Did Tom hurt you?
jbo: xu la tom pu cortygau do

source: Can I have a job?
jbo: xu mi se jibri da

source: Can I borrow $30?
jbo: e'apei mi jbera lo rupnu be li 30

source: Breathe normally.
jbo: ko vasxu cnano

source: You're my woman.
jbo: do me lo ninmu pe mi

source: You're my enemy.
jbo: do me lo mi bradi

source: You're my child.
jbo: do me lo mi panzi

source: You're in shock.
jbo: do ca'a se jenca

source: You're bleeding.
jbo: do blucri

source: You'll find one.
jbo: do ba tolcri pa da

source: You'd regret it.
jbo: da'i do xenru da bi'unai

source: You nearly died.
jbo: do pu naru'e co'a morsi

source: You lied to Tom.
jbo: do pu ticysku fi la tom

source: You have to eat.
jbo: ei do citka

source: You are excused.
jbo: do se fraxu

source: Why is Tom here?
jbo: seja'e ma la tom vi

source: Where's the key?
jbo: ma se zvati le ckiku

source: Where's the dog?
jbo: ma se zvati le gerku

source: We're all sorry.
jbo: ro mi'ai kecti

source: We love you all.
jbo: ro mi'ai prami ro do

source: We have to help.
jbo: ei mi'ai sidju

source: We aren't going.
jbo: mi'ai na termu'i

source: We are with you.
jbo: mi'ai kansa do

source: We are flexible.
jbo: mi'ai toltinsa

source: Tom's my friend.
jbo: lo tom cu pendo mi

source: Tom's my cousin.
jbo: lo tom mi tamne

source: Tom went to bed.
jbo: lo tom pu klama lo ckana

source: Tom wasn't rich.
jbo: lo tom na pu ricfu

source: Tom was worried.
jbo: la tom pu xanka

source: Tom was relaxed.
jbo: la tom pu surla

source: Tom was helpful.
jbo: la tom pu sidju ckaji

source: Tom was healthy.
jbo: la tom pu kanro

source: Tom was curious.
jbo: la tom pu kucli

source: Tom wants a job.
jbo: la tom pu djica lo se jibri

source: Tom walked fast.
jbo: la tom pu cadzu co sutra

source: Tom is very shy.
jbo: la tom cu mutce toldarsi

source: Tom has rabbits.
jbo: la tom cu ralte za'u lo ractu

source: Tom fed the dog.
jbo: la tom pu ctigau le gerku

source: Tom drinks beer.
jbo: la tom cu pinxe lo birje

source: Tom didn't move.
jbo: la tom na pu muvdu

source: They died young.
jbo: za'u ra pu co'a morsi fau lo ka citno

source: The police came.
jbo: lo pulji pu tolcliva

source: Silly, isn't it?
jbo: lo se bebna je'upei

source: It's hard to do.
jbo: nandu fa lo nu zukte

source: It was a secret.
jbo: pu se mipri

source: I'm in the city.
jbo: mi zvati le tcadu

source: I'm in the army.
jbo: mi cmima lo jenmi

source: I'm aware of it.
jbo: mi se slabu ra

source: I'm at the bank.
jbo: mi zvati le banxa

source: I'll reward you.
jbo: mi ba cnemu do

source: I'll inform Tom.
jbo: mi ba jungau la tom

source: I'll go do that.
jbo: mi ba klama soi te zukte ra

source: I'll go by taxi.
jbo: mi ba klama fu lo taksi

source: I'll go and see.
jbo: mi ba klama gice'o viska

source: I'll get my bag.
jbo: mi ba cpacu lo mi dakli

source: I'll do it, too.
jbo: mi ba zukte ra vau si'a

source: I'll destroy it.
jbo: mi ba daspo ra

source: I'll carry this.
jbo: mi ba bevri ti

source: I'll be patient.
jbo: mi ba denpa zukte

source: I work at a bar.
jbo: mi se jibri tu'a lo barja

source: I wish to leave.
jbo: mi djica lo ka cliva

source: I went to sleep.
jbo: mi pu klama co sipna

source: I was at school.
jbo: mi pu zvati lo ckule

source: I tried to help.
jbo: mi pu troci lo ka sidju

source: I love the idea.
jbo: mi nelci le sidbo

source: I hate tomatoes.
jbo: mi xebni lo tamca

source: I found my book.
jbo: mi pu tolcri lo mi cukta

source: Crows are black.
jbo: lo korvo cu xekri

source: Are you in pain?
jbo: xu do ca'o cortu

source: Are you in love?
jbo: xu do ca'a campa'i

source: You're a child.
jbo: do verba

source: You look silly.
jbo: do simlu lo ka bebna

source: You lied to us.
jbo: do pu ticysku fi mi'ai

source: You got taller.
jbo: do co'i clani zmadu

source: Why is Tom wet?
jbo: seja'e ma la tom cu cilmo

source: Tom wore a hat.
jbo: la tom pu dasni lo mapku

source: Tom smelled it.
jbo: la tom pu sumne ra

source: Tom didn't run.
jbo: la tom na pu bajra

source: This is my job.
jbo: za'adai jibri mi

source: This is a gift.
jbo: ti se dunda

source: This is a bomb.
jbo: ti jbama

source: I'm not so old.
jbo: mi na tai laldo

source: I'm not a baby.
jbo: mi na cifnu

source: I'm a bit late.
jbo: mi milxe lerci

source: I work at home.
jbo: mi gunka bu'u lo zdani

source: I was too late.
jbo: mi pu dukse lerci

source: I was an idiot.
jbo: mi pu bebna

source: I travel a lot.
jbo: mi so'ire'u litru

source: I have no food.
jbo: mi na ralte lo cidja

source: I hate carrots.
jbo: mi xebni lo ka'orta

source: Dancing is fun.
jbo: lo nu dansu cu zdile

source: Be careful, OK?
jbo: do kurji vi'opei

source: You look ugly.
jbo: do simlu lo ka tolmelbi

source: You know that.
jbo: do djuno ra

source: Who's calling?
jbo: ma ca'o fonta'a

source: Tom was proud.
jbo: la tom pu jgira

source: Tom was bored.
jbo: la tom pu badri

source: Tom likes you.
jbo: la tom cu nelci do

source: Tom has sheep.
jbo: la tom cu ralte lo lanme

source: Tom had a job.
jbo: la tom pu se jibri da

source: Tom had a dog.
jbo: la tom pu ralte lo gerku

source: Tom had a cat.
jbo: la tom pu ralte lo mlatu

source: Tom got happy.
jbo: la tom pu co'a gleki

source: Tom felt good.
jbo: la tom pu cinmo lo ka xamgu

source: Stay a moment.
jbo: ko stali ze'i

source: Life is great.
jbo: lo nunji'e cu banli

source: It was a mess.
jbo: ra pu kalsa

source: I'm unmarried.
jbo: mi se speni no da

source: I'm not blind.
jbo: nai mi nalviska

source: I'm not a cop.
jbo: mi na pulji

source: I'll stop you.
jbo: mi ba sisti do

source: I'll eat fish.
jbo: mi ba citka lo finpe

source: I'll be quiet.
jbo: mi ba smaji

source: I wish I knew.
jbo: au mi djuno da'i

source: I want it all.
jbo: mi djica ro ra

source: I told Tom no.
jbo: mi pu cusku fi la tom fe zo'ei naku

source: I love my dad.
jbo: mi nelci lo mi patfu .iu

source: I lost my hat.
jbo: mi pu cirko lo mi mapku

source: How delicious!
jbo: tai sai kukte

source: You sit here.
jbo: ca'e do zutse va

source: We live here.
jbo: mi'ai xabju vi

source: Wait outside.
jbo: ko denpa bu'u lo berti

source: That was bad.
jbo: ra pu xlali

source: Just say yes.
jbo: sa'u ko cusku zo ie

source: It was small.
jbo: pu cmalu

source: I'll keep it.
jbo: mi ba ralte ra

source: Can we do it?
jbo: xu mi'ai ka'e zukte da bi'unai

source: You know it.
jbo: do djuno da bi'unai

source: You cheated.
jbo: do pu tcica

source: They're red.
jbo: za'u ra xunre

source: They did it.
jbo: za'u ra pu zukte da bi'unai

source: It's stupid.
jbo: se bebna

source: It's for us.
jbo: seva'u mi'ai

source: I'll help.
jbo: e'e mi sidju

source: I did it.
jbo: mi pu co'e je'a

source: Hi, Tom.
jbo: coi tam.

source: I can't leave before the job is done.
jbo: mi ka'enai cliva pu lo nu mo'u gunka

source: I don't want to go anywhere.
jbo: mi na djica lo ka klama da

source: I want to give you my heart for ever.
jbo: mi djica lo nu do mi ze'e selpa'i

source: Could you make me a sandwich?
jbo: .e'o do jukpa lo snuji fi'o te dunda mi

source: She doesn't speak English.
jbo: ra poi fetsi na se glibau

source: What languages do you speak, Tom?
jbo: ma bangu do doi tom

source: I wonder if you are as busy as I am?
jbo: mi kucli lo nu xukau do tolcando du'i mi

source: When did Tom get married?
jbo: ca ma la tom pu co'a se speni

source: They found what they were looking for.
jbo: lo za'u ra pu tolcri lo jai se sisku be lo nei

source: We're here to have fun.
jbo: mi'a vi zvati co .ai se zdile

source: I'm here to have fun.
jbo: mi vi zvati tezu'e lo ka se zdile

source: She doesn't know who the father is.
jbo: ra na djuno lo nu makau patfu

source: She knows who the father is.
jbo: ma djuno lo nu makau patfu

source: Oh, really?
jbo: ge'e xu jetnu

source: Being wrong in what you are is easiest.
jbo: lo ka na'e drani co mokau cu filrai

source: No one has to help. And no one helps.
jbo: no da ei sidju i ca'aku noda sidju

source: I don't mind sleeping on the floor.
jbo: mi na pante lo nu da'i mi sipna soi cpana lo loldi

source: You can hear everything.
jbo: do ka'e tirna roda

source: Climb Mount Fuji, oh snail, but slowly, slowly.
jbo: doi cakcurnu fe lo salpo sefta be la fudzi cmana ko cpare co cmano .o'odai

source: I quit my job the day before yesterday.
jbo: mi co'u se jibri ca lo pruprulamdei

source: I quit my job two days ago.
jbo: mi pu co'u se jibri za lo djedi be li re

source: I'm studying French.
jbo: mi tadni lo frasybangu

source: Why do you care?
jbo: seja'e ma do kurji

source: The night is young.
jbo: lo nicte puzi cfari

source: If you're tired, go to bed.
jbo: fau lo nu do tatpi kei ko klama lo ckana

source: You aren't allowed in there.
jbo: do na jai se surmi fai lo ka vi zvati

source: You aren't allowed in this room.
jbo: do na jai se curmi fai lo ka zvati lo vi kumfa

source: He didnt want to talk about it anymore.
jbo: ra na pu djica lo ka ca'o tavla fi da bi'unai

source: Don't try to do this by yourself.
jbo: konai troci lo ka zukte si'unai

source: What you said is correct.
jbo: lo se cusku be do cu drani

source: She doesn't know anything about me.
jbo: ra poi fetsi cu djuno no da pe mi

source: This is a silver coin.
jbo: ti rijno sicni

source: Come on in. The water's great.
jbo: ko klama lo nenri i lo djacu cu banli

source: Come on in. The water's nice.
jbo: ko klama lo nenri i lo djacu cu jai pluka

source: Let's go swimming.
jbo: e'u klama co limna

source: These pants are dirty.
jbo: lo vi palku cu toljinsa

source: Tom said he was tired.
jbo: la tom pu cusku losedu'u ri tatpi

source: Tom said he was very tired.
jbo: la tom pu cusku losedu'u ri mutce tatpi

source: Tom said he was extremely tired.
jbo: la tom pu cusku losedu'u ri mutce tatpi

source: I'll solve that problem.
jbo: mi ba finti lo danfu be ra

source: Mary carried her son on her back.
jbo: la meris. bevri lo vo'a bersa sepi'o lo ra trixe

source: You know yourself best.
jbo: do traji slabu do

source: I've come to save her.
jbo: mi zvati mu'i lo nu nurgau ko'a

source: I've come to save him.
jbo: mi zvati mu'i lo nu nurgau ko'a

source: I've come to save the princess.
jbo: mi zvati mu'i lo nu nurgau lo noltruti'u

source: I've come to save Tom.
jbo: mi zvati mu'i lo nu nurgau la .tam.

source: Golf is boring.
jbo: a golf cu jai se badri

source: Live and learn.
jbo: ko jmive gije cilre

source: He melted her heart.
jbo: ra poi nakni pu rumgau pe'a lo risna be ra poi fetsi

source: He moved to Europe.
jbo: ra pu muvdu la europas

source: She moved to America.
jbo: ra pu muvdu la amerikas

source: She moved to Germany.
jbo: ra pu muvdu la dotco gugde

source: He moved to Canada.
jbo: ra pu muvdu la kanadas

source: He's well dressed.
jbo: ko'a dasni lo nobli

source: The girls looked at each other.
jbo: za'u lo nixli pu catlu simxu

source: The boys looked at each other.
jbo: za'u lo nanla pu catlu simxu

source: Aardvarks are nocturnal animals.
jbo: lo arduarko cu nicte danlu

source: Aardvarks are excellent diggers.
jbo: lo arduarko cu ekselenta kakpa

source: I don't want to talk about my child.
jbo: mi djica nai lo ka tavla fi lo pe mi panzi

source: I don't want you to think about it anymore.
jbo: mi djica nai lo nu do ca'o pensi ra

source: I want to talk to you about something else.
jbo: mi .au tavla do da poi drata

source: I hate policemen like him.
jbo: mi xebni lo pulji poi simsa ra

source: I'm not sure I want to see this.
jbo: mi birti nai lo nu mi djica lo ka viska ti

source: I'm trying to figure out something.
jbo: mi ca ca'o troci lo ka jimpe da

source: If you really want to know, all you have to do is ask.
jbo: jaginai do djica je'u lo ka djuno gi do ei reisku po'o

source: Is there anything you want to tell us?
jbo: pei do djica loka cusku fi mi'ai fe da

source: It doesn't look so bad.
jbo: nai simlu lo ka mutce xlali

source: It doesn't matter so much.
jbo: nai mutce vajni

source: No one speaks with me.
jbo: no da tavla mi

source: There's so much I want to say to you.
jbo: fe so'i da fa mi .au cusku do

source: We've arrived a little late.
jbo: mi'ai mo'u tolyli'a fi'o milxe lerci

source: What's the real reason you don't want to do this?
jbo: ma jetnu krinu lo nu do djica nai lo ka zukte ra

source: Not everything that you say in Lojban should be rational.
jbo: ro da poi do cusku bau ly cu jai racli naku vau ca'e

source: I hear only you.
jbo: mi tirna do po'o

source: Why don't you wear a dress?
jbo: mu'i ma do na dasni lo pasyskaci

source: Why would you want to do something like that?
jbo: ki'u ma do djica lo ka zukte lo simsa be ra

source: You can do whatever you want to do, of course.
jbo: do e'a zukte lo se djica be do vau li'a

source: You don't seem too happy to see me.
jbo: do simlu nai lo ka mutce gleki lo ka zgana mi

source: You've already forgotten.
jbo: do ba'o morji

source: What happens today?
jbo: ma cabdei fasnu

source: It's a plan to implement.
jbo: bi'ucu'i da se platu gije ei zukte

source: I am a Christian woman.
jbo: mi xriso ninmu

source: I am a Christian girl.
jbo: mi xriso ninmu

source: If I were you, I'd ignore it.
jbo: mi ganai da'i du do gi toljundi zo'e bi'unai

source: I'll give that to Tom.
jbo: mi ba dunda tu la tom

source: Today is a special day.
jbo: le cabdei cu steci djedi

source: Tom is about half Mary's age.
jbo: la .tom. cu jai se ditcu pimuji'i ditcu be tu'a la .maris.

source: Your handwriting is very good.
jbo: do xance ciska tasmi cu mutce xamgu

source: Too lengthy. One can cook coffee during that time.
jbo: clani dukse .i lo nu cusku cu se ditcu lo banzu be lo nu jukpa lo ckafi

source: Dancing is prohibited.
jbo: lo nu dansu cu tolselcurmi

source: When he was a child, he lived in a small town.
jbo: puku ca lo nu ra verba kei ra xabju lo cmalu tcadu

source: The tire on my bicycle is flat.
jbo: le xilckabu pe lo mi relxilma'e cu plita

source: I know who lives in this house.
jbo: mi djuno lodu'u makau xabju lo vi dinju

source: I know who lives in that house.
jbo: mi djuno lodu'u makau xabju lo va dinju

source: Sarah sings a happy song, a happy song Sarah sings.
jbo: la saras cu sanga lo se gleki gije fe lo se gleki fa la saras cu sanga

source: You understand me and that's the most important thing.
jbo: do jimpe tu'a mi i sefabo traji vajni

source: You're in my heart.
jbo: pe'a do nenri lo mi risna

source: I want to leave school.
jbo: .au mi cliva lo ckule

source: I've never thought about it.
jbo: mi nu'o pensi ra

source: I remember that Lenin listened to theremin in 1920 (but of course I wasn't there in person at that time).
jbo: mi vedli na je morji lo nu la lenin pu pilno la termenvoks ca lo nanca be li 1920

source: I like you more than you like me.
jbo: mi ce'oi do zmadu do ce'oi mi lo ni ce'u nelci ce'u

source: Did Tom eat all the cookies?
jbo: xu la .tam. cu citka ro lo titnanba

source: My mother made cookies this morning.
jbo: lo mi mamta ku jukpa lo titnanba ca lo vi cerni

source: Tom's mother made cookies this morning.
jbo: lo mamta be la .tam. cu jukpa lo titnanba ca lo vi cerni

source: Tom and Mary are looking for John.
jbo: la tom jo'u la maris caca'o sisku tu'a la djon

source: I know Tom quite well.
jbo: mi se slabu la tom soi banzu xamgu

source: I sing a beautiful song.
jbo: mi sanga lo melbi

source: I like eating seafood.
jbo: mi nelci lo ka citka lo xamsi cidja

source: I live in Athens.
jbo: mi xabju la atenais

source: I live in a city.
jbo: mi xabju lo tcadu

source: Truth alone triumphs.
jbo: lo jetnu be fau lo ka sepli cu mulno jinga

source: I go to the church on Sundays.
jbo: mi klama lo malsi ta'e lo zeldei

source: I like the waves of the Black Sea.
jbo: mi nelci lei boxna pe la xekri xamsi

source: He's so big!
jbo: ra barda sai

source: Put your hand on my shoulder.
jbo: ko punji lo do xance lo mi birjanco

source: I want to be a teacher.
jbo: mi djica lo nu mi ctuca

source: There is a cat five meters from the tree.
jbo: .i bu'u lo tricu va lo mitre be li mu cu mlatu

source: I need to study well.
jbo: mi nitcu lo ka cilre co xamgu

source: He wrote the book.
jbo: ra pu ciska lo cukta

source: I drank the wine.
jbo: mi pu pinxe lo vanju

source: I read your book.
jbo: mi cajapu tcidu fi lo do cukta

source: He showed us a picture of his mother.
jbo: ko'a visygau mi'ai lo pixra be lo ko'a mamta

source: Let me be yours.
jbo: .i mi me ko moi

source: I really like seafood.
jbo: mi je'a nelci lo xamsi cidja

source: What?! No! Are you really fucking with my date?
jbo: .uecai.ianai .i xu do je'a gletu lo pampe'o be ra

source: This sentence wouldn't be funny if not for irony.
jbo: .i da'i dei na'e xajmi seja'eda'i lo nu na'e ranxi

source: The boy ate the apple.
jbo: lo nanla pu citka lo plise

source: We were not afraid.
jbo: mi'ai pu na terpa

source: The apple is eaten by the child.
jbo: lo plise ba'o se citka lo verba

source: Croatia was so beautiful.
jbo: la .xrvatsk. pu melbi sai

source: Be what you want to be.
jbo: ko ckaji lo se djica be do

source: There are more messages on Loglan mailing list than on Lojban mailing list every day.
jbo: ca ro djedi jegi lo se mrilu be lo lojbo mriste cu zilkancu da gi jegi zo'e ne lo loglo cu zilkancu de gi de zmadu da

source: It's under the chair.
jbo: ra cnita lo stizu

source: Thanks! I'll see you soon!
jbo: ki'e i mi viska do bazi

source: It's not likely but possible.
jbo: sai nai na lakne

source: They love studying music.
jbo: ko'a se puktce lo nu tadni lo zgike

source: I hate winter.
jbo: mi xebni lo dunra

source: Don't touch my daughter!
jbo: ko na pencu lo tixnu be mi

source: A lucid dream is any dream in which one is aware that one is dreaming.
jbo: da poi se sajysne zo'u da se senva zo'e poi ke'a ca'a sanji lo du'u ke'a senva

source: The day was hot.
jbo: ca lo djedi pu glare

source: I love anal sex.
jbo: .i mi prami gaxygle

source: A man like me needs a hat.
jbo: lo tai mi prenu cu nitci lo mapku

source: There's a hotel here.
jbo: da xotli vi

source: Tom feeds his dog twice a day.
jbo: la tom cu ctigau lo ri gerku reroi ro djedi

source: I'm certain, I saw him.
jbo: ju'o mi pu viska ra

source: He wants to read a book.
jbo: ra djica lo ka tcidu lo cukta

source: You're smaller than Tom.
jbo: do cmalymau la tom

source: There's a park near my house.
jbo: da panka vi lo mi zdani

source: I'm not your daughter.
jbo: mi na tixnu do

source: I didn't lose them.
jbo: mi na pu cirko za'u ra

source: Hokaido is pretty far, isn't it?
jbo: la xokaidos cu banzu farno vau je'unaipei

source: What he says is holy truth.
jbo: lo selsku be ra cu censa jetnu

source: Speak in Lojban or about Lojban.
jbo: ko tavla fo ja fi lo jbobau

source: Tatoeba contains 10 000 Lojbanic sentences.
jbo: i panoki'o lojbo jufra cu se vasru la tato'ebas

source: Your horse is beautiful.
jbo: lo pe do xirma cu melbi

source: The soldier enjoys game and danger, and that is why he enjoys women who are the most dangerous of playthings.
jbo: .i lo sonci cu se pluka lo ckape je lo nunkei gi'e se mu'i bo nelci lo ninmu ku noi jai caprai co selkei

source: My father listens to classical music.
jbo: lo be mi patfu cu tinzga lo klasika zgike

source: That river is long.
jbo: le rirxe cu clani

source: That book is easy.
jbo: le cukta cu jai frili

source: That car is very fast.
jbo: lo va karce cu mutce sutra

source: At the entrance of a Japanese house, visitors are generally asked to take off their shoes.
jbo: bu'u lo nerklastu be lo ponjo zdani lo vitke cu ei ba'a vimcu lo vo'a cutci

source: Tom kept quiet.
jbo: la tom pu ca'o smaji

source: My leg is still asleep.
jbo: lo pe mi tuple cu ca'o sipna

source: This building is new.
jbo: lo vi dinju cu cnino

source: This is not normal.
jbo: ti na cnano

source: I am eating, which is different to drinking.
jbo: .i mi citka no'oi ke'a drata lo ka pinxe

source: What is your address?
jbo: ma judri do

source: Everybody is the architect of their own fortune.
jbo: ro da enge lo jai funca be vo'a

source: The house was big.
jbo: le dinju cu barda

source: My mobile phone is broken.
jbo: lo pe mi xance fonxa cu spofu

source: Kill the bunnies first.
jbo: ko pu catra lo ractu

source: We have to decide today.
jbo: ei mi'ai jdice ca lo cabdei

source: Be kind to Mary.
jbo: ko xendo la maris

source: This is my house.
jbo: ti me lo dinju pe mi

source: Can he see our horse?
jbo: xu ra ka'e viska lo pe mi'ai xirma

source: Do you see my father?
jbo: pei do pu viska lo be mi patfu

source: Can you see my father?
jbo: pei do ka'e viska lo be mi patfu

source: She has very short hair.
jbo: ra se kerfa lo mutce tordu

source: This is red wine.
jbo: ti xunre vanju

source: You are strong.
jbo: do tsali

source: I can't speak English.
jbo: mi na se glibau

source: We will visit you.
jbo: mi'ai ba vitke do

source: He likes animals.
jbo: ra nelci lo danlu

source: The ball fell because I stopped holding it up.
jbo: .i le bolci cu farlu ri'a lo nu mi co'u sarji ri

source: I don't know why my head hurts.
jbo: mi na djuno lo du'u ri'a ma kau mi cortu le stedu

source: What caused you to be able to breathe without dying and without using an air-cleaner?
jbo: .i ma rinka lo nu .ue mi ka'e vasxu se ri'a nai lo nu mrobi'o kei sepi'o nai lo vacri lumci cabra

source: I like you, but not just because you're beautiful.
jbo: .i mi nelci do ri'anai lo za'i do melbi

source: Precisely speaking, I need six hours to at least think straight. Additionally, I need seven hours to be happy.
jbo: .i sa'e mi nitcu xa le cacra seri'a le nu mi milxe xamgu pensi .iji'a mi nitcu ze le cacra seri'a le nu mi gleki

source: You hit me, which results in my pain.
jbo: .i do darxi mi seri'a lo za'i mi cortu

source: I am not dead, but that doesn't stop me from being food.
jbo: .i mi morsi nai seri'anai lo nu ba'o se citka

source: When I have to go to the store, the car is a vehicle.
jbo: .i le karce cu xe klama teri'a loza'i mi bilga lonu klama le zarci

source: "Hello Every" is really grammatically correct, logically because of a crazy rule of an expression source.
jbo: lu coi ro li'u ja'a gendra ni'i lo cizra javni po lo se cusku krasi

source: Plato dies, which follows logically because he is human.
jbo: .i la .platon. cu mrobi'o ni'i le du'u py remna

source: Hey James, by what logic are you not really familiar with me?
jbo: doi djeims do ni'i ma norsau mi

source: You believe that it is grammatically correct by what logic?
jbo: do krici lo du'u gendra ni'i ma

source: It's probably a person. However, not logically entailing Peter's expression...
jbo: .i la'a prenu .i ku'i ni'inai lo se cusku pe la petr.

source: Your being obliged to wear pants doesn't logically follow from the state of your being a man.
jbo: .i do bilga lonu pilno lo palku kei ni'inai loza'i do nanmu

source: Because of that, nothing lojbanic is expressed.
jbo: .i se ni'i ri cusku no da poi lojbo
